/* ####################################################################################################################
 * ログインし、登録したことのあるユーザ
 * ログインするたびに updatedAt を更新する
 * ################################################################################################################# */
export class RegisteredUser {
    constructor(
            public readonly uid: string,
            public updatedAt?: number,
            public ceatedAt?: number ) {
    }
}

/* ####################################################################################################################
 * ログインし、登録したことのあるユーザ
 * ログインするたびに updatedAt を更新する
 * ################################################################################################################# */
export class UserPermission {
    constructor(
            public readonly uid: string,
            public updatedAt?: number,
            public ceatedAt?: number ) {
    }
}
